isi-ies-group/Window_Control/STM32_wifi/STM32Workspace/ST67W6X_HTTP_Server/Drivers/BSP/Components/lsm6dsv16x/lsm6dsv16x_reg.h
typedef enum
{
  LSM6DSV16X_AUTO          = 0x0,
  LSM6DSV16X_ALWAYS_ACTIVE = 0x1,
} lsm6dsv16x_filt_anti_spike_t;
int32_t lsm6dsv16x_filt_anti_spike_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16x_filt_anti_spike_t val);
int32_t lsm6dsv16x_filt_anti_spike_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16x_filt_anti_spike_t *val);

typedef struct
{
  uint8_t drdy                 : 1;
  uint8_t ois_drdy             : 1;
  uint8_t irq_xl               : 1;
  uint8_t irq_g                : 1;
} lsm6dsv16x_filt_settling_mask_t;
int32_t lsm6dsv16x_filt_settling_mask_set(const stmdev_ctx_t *ctx,
                                          lsm6dsv16x_filt_settling_mask_t val);
int32_t lsm6dsv16x_filt_settling_mask_get(const stmdev_ctx_t *ctx,
                                          lsm6dsv16x_filt_settling_mask_t *val);

typedef struct
{
  uint8_t ois_drdy             : 1;
} lsm6dsv16x_filt_ois_settling_mask_t;
int32_t lsm6dsv16x_filt_ois_settling_mask_set(const stmdev_ctx_t *ctx,
                                              lsm6dsv16x_filt_ois_settling_mask_t val);
int32_t lsm6dsv16x_filt_ois_settling_mask_get(const stmdev_ctx_t *ctx,
                                              lsm6dsv16x_filt_ois_settling_mask_t *val);

typedef enum
{
  LSM6DSV16X_GY_ULTRA_LIGHT   = 0x0,
  LSM6DSV16X_GY_VERY_LIGHT    = 0x1,
  LSM6DSV16X_GY_LIGHT         = 0x2,
  LSM6DSV16X_GY_MEDIUM        = 0x3,
  LSM6DSV16X_GY_STRONG        = 0x4,
  LSM6DSV16X_GY_VERY_STRONG   = 0x5,
  LSM6DSV16X_GY_AGGRESSIVE    = 0x6,
  LSM6DSV16X_GY_XTREME        = 0x7,
} lsm6dsv16x_filt_gy_lp1_bandwidth_t;
int32_t lsm6dsv16x_filt_gy_lp1_bandwidth_set(const stmdev_ctx_t *ctx,
                                             lsm6dsv16x_filt_gy_lp1_bandwidth_t val);
int32_t lsm6dsv16x_filt_gy_lp1_bandwidth_get(const stmdev_ctx_t *ctx,
                                             lsm6dsv16x_filt_gy_lp1_bandwidth_t *val);

int32_t lsm6dsv16x_filt_gy_lp1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_filt_gy_lp1_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_XL_ULTRA_LIGHT = 0x0,
  LSM6DSV16X_XL_VERY_LIGHT  = 0x1,
  LSM6DSV16X_XL_LIGHT       = 0x2,
  LSM6DSV16X_XL_MEDIUM      = 0x3,
  LSM6DSV16X_XL_STRONG      = 0x4,
  LSM6DSV16X_XL_VERY_STRONG = 0x5,
  LSM6DSV16X_XL_AGGRESSIVE  = 0x6,
  LSM6DSV16X_XL_XTREME      = 0x7,
} lsm6dsv16x_filt_xl_lp2_bandwidth_t;
int32_t lsm6dsv16x_filt_xl_lp2_bandwidth_set(const stmdev_ctx_t *ctx,
                                             lsm6dsv16x_filt_xl_lp2_bandwidth_t val);
int32_t lsm6dsv16x_filt_xl_lp2_bandwidth_get(const stmdev_ctx_t *ctx,
                                             lsm6dsv16x_filt_xl_lp2_bandwidth_t *val);

int32_t lsm6dsv16x_filt_xl_lp2_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_filt_xl_lp2_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_filt_xl_hp_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_filt_xl_hp_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsv16x_filt_xl_fast_settling_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_filt_xl_fast_settling_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_HP_MD_NORMAL    = 0x0,
  LSM6DSV16X_HP_MD_REFERENCE = 0x1,
} lsm6dsv16x_filt_xl_hp_mode_t;
int32_t lsm6dsv16x_filt_xl_hp_mode_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16x_filt_xl_hp_mode_t val);
int32_t lsm6dsv16x_filt_xl_hp_mode_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16x_filt_xl_hp_mode_t *val);

typedef enum
{
  LSM6DSV16X_WK_FEED_SLOPE          = 0x0,
  LSM6DSV16X_WK_FEED_HIGH_PASS      = 0x1,
  LSM6DSV16X_WK_FEED_LP_WITH_OFFSET = 0x2,
} lsm6dsv16x_filt_wkup_act_feed_t;
int32_t lsm6dsv16x_filt_wkup_act_feed_set(const stmdev_ctx_t *ctx,
                                          lsm6dsv16x_filt_wkup_act_feed_t val);
int32_t lsm6dsv16x_filt_wkup_act_feed_get(const stmdev_ctx_t *ctx,
                                          lsm6dsv16x_filt_wkup_act_feed_t *val);

int32_t lsm6dsv16x_mask_trigger_xl_settl_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsv16x_mask_trigger_xl_settl_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV16X_SIXD_FEED_ODR_DIV_2 = 0x0,
  LSM6DSV16X_SIXD_FEED_LOW_PASS  = 0x1,
} lsm6dsv16x_filt_sixd_feed_t;
int32_t lsm6dsv16x_filt_sixd_feed_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv16x_filt_sixd_feed_t val);
int32_t lsm6dsv16x_filt_sixd_feed_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv16x_filt_sixd_feed_t *val);

typedef enum
{
  LSM6DSV16X_EIS_LP_NORMAL = 0x0,
  LSM6DSV16X_EIS_LP_LIGHT  = 0x1,
} lsm6dsv16x_filt_gy_eis_lp_bandwidth_t;
int32_t lsm6dsv16x_filt_gy_eis_lp_bandwidth_set(const stmdev_ctx_t *ctx,
                                                lsm6dsv16x_filt_gy_eis_lp_bandwidth_t val);
int32_t lsm6dsv16x_filt_gy_eis_lp_bandwidth_get(const stmdev_ctx_t *ctx,
                                                lsm6dsv16x_filt_gy_eis_lp_bandwidth_t *val);

typedef enum
{
  LSM6DSV16X_OIS_GY_LP_NORMAL     = 0x0,
  LSM6DSV16X_OIS_GY_LP_STRONG     = 0x1,
  LSM6DSV16X_OIS_GY_LP_AGGRESSIVE = 0x2,
  LSM6DSV16X_OIS_GY_LP_LIGHT      = 0x3,
} lsm6dsv16x_filt_gy_ois_lp_bandwidth_t;
int32_t lsm6dsv16x_filt_gy_ois_lp_bandwidth_set(const stmdev_ctx_t *ctx,
                                                lsm6dsv16x_filt_gy_ois_lp_bandwidth_t val);
int32_t lsm6dsv16x_filt_gy_ois_lp_bandwidth_get(const stmdev_ctx_t *ctx,
                                                lsm6dsv16x_filt_gy_ois_lp_bandwidth_t *val);

typedef enum
{
  LSM6DSV16X_OIS_XL_LP_ULTRA_LIGHT = 0x0,
  LSM6DSV16X_OIS_XL_LP_VERY_LIGHT  = 0x1,
  LSM6DSV16X_OIS_XL_LP_LIGHT       = 0x2,
  LSM6DSV16X_OIS_XL_LP_NORMAL      = 0x3,
  LSM6DSV16X_OIS_XL_LP_STRONG      = 0x4,
  LSM6DSV16X_OIS_XL_LP_VERY_STRONG = 0x5,
  LSM6DSV16X_OIS_XL_LP_AGGRESSIVE  = 0x6,
  LSM6DSV16X_OIS_XL_LP_XTREME      = 0x7,
} lsm6dsv16x_filt_xl_ois_lp_bandwidth_t;
int32_t lsm6dsv16x_filt_xl_ois_lp_bandwidth_set(const stmdev_ctx_t *ctx,
                                                lsm6dsv16x_filt_xl_ois_lp_bandwidth_t val);
int32_t lsm6dsv16x_filt_xl_ois_lp_bandwidth_get(const stmdev_ctx_t *ctx,
                                                lsm6dsv16x_filt_xl_ois_lp_bandwidth_t *val);

